Revit 2024 API
UIMacroManager.GetMacroManager Method (UIDocument)
 Gets the UI Macro manager from the UI document.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static UIMacroManager GetMacroManager(
	UIDocument document
)
Visual Basic
Public Shared Function GetMacroManager ( _
	document As UIDocument _
) As UIMacroManager
Visual C++
public:
static UIMacroManager^ GetMacroManager(
	UIDocument^ document
)
Parameters
document
Type: Autodesk.Revit.UI.UIDocument
 The UI document.
Return Value
 The new UI Macro manager object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
UIMacroManager Class
GetMacroManager Overload
Autodesk.Revit.UI.Macros Namespace